;; -*- no-byte-compile: t; -*-
;;; ~/.doom.d/packages.el

;;; Examples:
;; (package! some-package)
;; (package! another-package :recipe (:fetcher github :repo "username/repo"))
;; (package! builtin-package :disable t)
(package! ox-pandoc)
(package! exec-path-from-shell)
(package! dumb-jump)
(package! irony)
(package! all-the-icons)
(package! zenburn-theme)
(package! treemacs)
(package! treemacs-evil)
(package! treemacs-projectile)
(package! treemacs-magit)
(package! treemacs-icons-dired)
(package! org-super-agenda)
